ConnectTest/src/Catalogs/gyms/gyms.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>gyms</name>
  <attributes>
    <name>activationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>additional</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>address</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chains</types>
    </type>
  </attributes>
  <attributes>
    <name>city</name>
    <type>
      <types>CatalogRef.cities</types>
    </type>
  </attributes>
  <attributes>
    <name>departmentWorkSchedule</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>state</name>
    <type>
      <types>EnumRef.gymStates</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>holidaysTime</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>latitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>longitude</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>nearestMetro</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>photo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>segment</name>
    <type>
      <types>CatalogRef.segments</types>
    </type>
  </attributes>
  <attributes>
    <name>type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weekdaysTime</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>photos</name>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>CatalogRef.languages</types>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>address</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>departmentWorkSchedule</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>nearestMetro</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>additional</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/gyms/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = data.getValueTable();
	attributesTableForNewItem = data.getValueTable();

	data.addRowInAttributesTable(attributesTable, "description", "name", "string");
	data.addRowInAttributesTable(attributesTable, "address", "gymAddress", "string");
	data.addRowInAttributesTable(attributesTable, "latitude", "latitude", "number");
	data.addRowInAttributesTable(attributesTable, "longitude", "longitude", "number");
	data.addRowInAttributesTable(attributesTable, "photo", "photo", "string");
	data.addRowInAttributesTable(attributesTable, "departmentWorkSchedule", "departments", "JSON");
	data.addRowInAttributesTable(attributesTable, "nearestMetro", "metro", "JSON");
	data.addRowInAttributesTable(attributesTable, "additional", "additional", "JSON");
	data.addRowInAttributesTable(attributesTable, "city", "city", "ref");
	data.addRowInAttributesTable(attributesTable, "translation", "translation", "valueTable");
	data.addRowInAttributesTable(attributesTable, "photos", "photos", "valueTable");
//	data.addRowInAttributesTable(attributesTable, "segment", "division", "string");
//	data.addRowInAttributesTable(attributesTable, "type", "type", "string");

	attributesTranslation = data.getValueTable();

	data.addRowInAttributesTable(attributesTranslation, "language", "language", "ref");
	data.addRowInAttributesTable(attributesTranslation, "description", "description", "string");
	data.addRowInAttributesTable(attributesTranslation, "address", "gymAddress", "string");
	data.addRowInAttributesTable(attributesTranslation, "departmentWorkSchedule", "departments", "JSON");
	data.addRowInAttributesTable(attributesTranslation, "nearestMetro", "metro", "JSON");
	data.addRowInAttributesTable(attributesTranslation, "additional", "additional", "JSON");

	attributesPhotos = data.getValueTable();
	data.addRowInAttributesTable(attributesPhotos, "URL", "URL", "string");

	mdStruct = New Structure();
	mdStruct.Insert("translation", attributesTranslation);
	mdStruct.Insert("photos", attributesPhotos);
	mdStruct.Insert("language", New Structure("languages", "code"));
	mdStruct.Insert("city", New Structure("cities", "uid"));

	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", True, "gyms", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
